# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = input("Введите трехзначное число: ")
i = 0
b = 0
while i < 3:
    a = int(number[i])
    b = b + a
    i = i + 1

print(b)


